In [2]:
import pandas as pd 
import numpy as np

In [277]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [278]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

In [279]:
df.iloc[1:2,1:2]=10055.0
df.iloc[3:4,1:2]=10075.0

In [230]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [231]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   From_To       5 non-null      object
 1   FlightNumber  5 non-null      float64
 2   RecentDelays  5 non-null      object
 3   Airline       5 non-null      object
dtypes: float64(1), object(3)
memory usage: 288.0+ bytes

2.The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

In [280]:
ls1=df['From_To'].apply(lambda i: i)

In [281]:
ls2=ls1.apply(lambda j:j.split('_'))

In [282]:
From=[]
To=[]
for l in ls2:
  for m in range(2):
    if m==0:
      From.append(l[m])
    else:
      To.append(l[m])

In [283]:
df['From']=From

In [284]:
df['To']=To

In [285]:
df

            From_To  FlightNumber  ...      From         To
0      LoNDon_paris       10045.0  ...    LoNDon      paris
1      MAdrid_miLAN       10055.0  ...    MAdrid      miLAN
2  londON_StockhOlm       10065.0  ...    londON  StockhOlm
3    Budapest_PaRis       10075.0  ...  Budapest      PaRis
4   Brussels_londOn       10085.0  ...  Brussels     londOn

[5 rows x 6 columns]

3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

In [286]:
df['From']=df['From'].apply(lambda x: x.title())

In [287]:
df['To']=df['To'].apply(lambda x: x.title())

In [288]:
df

            From_To  FlightNumber  ...      From         To
0      LoNDon_paris       10045.0  ...    London      Paris
1      MAdrid_miLAN       10055.0  ...    Madrid      Milan
2  londON_StockhOlm       10065.0  ...    London  Stockholm
3    Budapest_PaRis       10075.0  ...  Budapest      Paris
4   Brussels_londOn       10085.0  ...  Brussels     London

[5 rows x 6 columns]

4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.

In [289]:
df.drop('From_To',axis=1,inplace=True)

In [290]:
df.columns

Index(['FlightNumber', 'RecentDelays', 'Airline', 'From', 'To'], dtype='object')

In [291]:
df.reindex(['From','To','FlightNumber', 'RecentDelays', 'Airline'],axis=1)

       From         To  FlightNumber  RecentDelays              Airline
0    London      Paris       10045.0      [23, 47]               KLM(!)
1    Madrid      Milan       10055.0            []    <Air France> (12)
2    London  Stockholm       10065.0  [24, 43, 87]  (British Airways. )
3  Budapest      Paris       10075.0          [13]       12. Air France
4  Brussels     London       10085.0      [67, 32]          "Swiss Air"

5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each

second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.

In [420]:
def denest(data):
  dct={}
  ctr=0
  for i in range(len(data)):
    try:

      if dct.__contains__(dct['delay_%d'%(i+1)])==True:
        dct['delay_%d'%(i+1)].append(data[i])
    except:

        dct['delay_%d'%(i+1)]=[]
        dct['delay_%d'%(i+1)].append(data[i])
  return dct

In [421]:
a=df['RecentDelays'].apply(denest)

In [422]:
a

0                   {'delay_1': [23], 'delay_2': [47]}
1                                                   {}
2    {'delay_1': [24], 'delay_2': [43], 'delay_3': ...
3                                    {'delay_1': [13]}
4                   {'delay_1': [67], 'delay_2': [32]}
Name: RecentDelays, dtype: object

In [427]:
ctr=0
for i in range(len(a)):
  for j in a[i].keys():
    for k in (a[i][j]):
      try:
       df['%s'%j][i]=k
      except:
        df['%s'%j]=''
        df['%s'%j][i]=k

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  if __name__ == '__main__':

In [428]:
df

   FlightNumber  RecentDelays              Airline  ... delay_1 delay_2 delay_3
0       10045.0      [23, 47]               KLM(!)  ...      23      47
1       10055.0            []    <Air France> (12)  ...
2       10065.0  [24, 43, 87]  (British Airways. )  ...      24      43      87
3       10075.0          [13]       12. Air France  ...      13
4       10085.0      [67, 32]          "Swiss Air"  ...      67      32

[5 rows x 10 columns]

In [432]:
df.drop(columns='RecentDelays',inplace=True)

In [435]:
df

   FlightNumber              Airline      From  ... delay_1 delay_2 delay_3
0       10045.0               KLM(!)    London  ...      23      47
1       10055.0    <Air France> (12)    Madrid  ...
2       10065.0  (British Airways. )    London  ...      24      43      87
3       10075.0       12. Air France  Budapest  ...      13
4       10085.0          "Swiss Air"  Brussels  ...      67      32

[5 rows x 7 columns]